benchmark_results.txt
====== PING_INLINE ======
  100000 requests completed in 2.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= 0.1 milliseconds
0.37% <= 0.2 milliseconds
11.85% <= 0.3 milliseconds
32.88% <= 0.4 milliseconds
53.06% <= 0.5 milliseconds
72.47% <= 0.6 milliseconds
87.16% <= 0.7 milliseconds
93.64% <= 0.8 milliseconds
96.46% <= 0.9 milliseconds
98.00% <= 1.0 milliseconds
98.74% <= 1.1 milliseconds
99.17% <= 1.2 milliseconds
99.43% <= 1.3 milliseconds
99.55% <= 1.4 milliseconds
99.64% <= 1.5 milliseconds
99.75% <= 1.6 milliseconds
99.83% <= 1.7 milliseconds
99.89% <= 1.8 milliseconds
99.92% <= 1.9 milliseconds
99.93% <= 2 milliseconds
99.99% <= 3 milliseconds
100.00% <= 3 milliseconds
41911.15 requests per second

====== PING_BULK ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

94.74% <= 1 milliseconds
99.34% <= 2 milliseconds
99.68% <= 3 milliseconds
99.75% <= 4 milliseconds
99.80% <= 5 milliseconds
99.81% <= 6 milliseconds
99.83% <= 7 milliseconds
99.86% <= 8 milliseconds
99.91% <= 9 milliseconds
99.97% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.98% <= 15 milliseconds
99.98% <= 16 milliseconds
99.99% <= 17 milliseconds
99.99% <= 21 milliseconds
99.99% <= 22 milliseconds
99.99% <= 220 milliseconds
99.99% <= 221 milliseconds
100.00% <= 431 milliseconds
37893.14 requests per second

====== SET ======
  100000 requests completed in 2.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

95.56% <= 1 milliseconds
99.60% <= 2 milliseconds
99.69% <= 3 milliseconds
99.76% <= 4 milliseconds
99.77% <= 5 milliseconds
99.78% <= 6 milliseconds
99.79% <= 7 milliseconds
99.81% <= 8 milliseconds
99.88% <= 9 milliseconds
99.97% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
99.97% <= 13 milliseconds
99.98% <= 14 milliseconds
99.98% <= 15 milliseconds
99.98% <= 16 milliseconds
99.98% <= 17 milliseconds
99.99% <= 24 milliseconds
99.99% <= 25 milliseconds
99.99% <= 218 milliseconds
100.00% <= 219 milliseconds
35663.34 requests per second

====== GET ======
  100000 requests completed in 2.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

95.79% <= 1 milliseconds
99.45% <= 2 milliseconds
99.68% <= 3 milliseconds
99.81% <= 4 milliseconds
99.85% <= 5 milliseconds
99.86% <= 6 milliseconds
99.86% <= 7 milliseconds
99.87% <= 8 milliseconds
99.88% <= 9 milliseconds
99.92% <= 10 milliseconds
99.96% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.98% <= 14 milliseconds
99.98% <= 16 milliseconds
99.98% <= 17 milliseconds
99.98% <= 26 milliseconds
99.99% <= 210 milliseconds
100.00% <= 420 milliseconds
100.00% <= 420 milliseconds
35790.98 requests per second

====== INCR ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= -1 milliseconds
0.03% <= 0 milliseconds
97.69% <= 1 milliseconds
99.93% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
99.97% <= 5 milliseconds
99.97% <= 6 milliseconds
99.97% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
99.98% <= 10 milliseconds
99.98% <= 12 milliseconds
99.98% <= 15 milliseconds
99.98% <= 16 milliseconds
99.98% <= 17 milliseconds
99.98% <= 208 milliseconds
99.99% <= 209 milliseconds
100.00% <= 418 milliseconds
100.00% <= 418 milliseconds
37622.27 requests per second

====== LPUSH ======
  100000 requests completed in 84.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

2.08% <= 1 milliseconds
2.17% <= 2 milliseconds
2.17% <= 3 milliseconds
2.18% <= 4 milliseconds
2.18% <= 5 milliseconds
2.18% <= 6 milliseconds
2.23% <= 7 milliseconds
2.36% <= 8 milliseconds
2.62% <= 9 milliseconds
2.96% <= 10 milliseconds
3.21% <= 11 milliseconds
3.42% <= 12 milliseconds
3.56% <= 13 milliseconds
3.66% <= 14 milliseconds
3.70% <= 15 milliseconds
3.76% <= 16 milliseconds
3.85% <= 17 milliseconds
3.91% <= 18 milliseconds
3.96% <= 19 milliseconds
4.08% <= 20 milliseconds
4.16% <= 21 milliseconds
4.28% <= 22 milliseconds
4.63% <= 23 milliseconds
5.37% <= 24 milliseconds
7.26% <= 25 milliseconds
9.86% <= 26 milliseconds
12.79% <= 27 milliseconds
15.49% <= 28 milliseconds
17.87% <= 29 milliseconds
20.44% <= 30 milliseconds
23.39% <= 31 milliseconds
26.62% <= 32 milliseconds
30.12% <= 33 milliseconds
33.18% <= 34 milliseconds
35.95% <= 35 milliseconds
38.42% <= 36 milliseconds
40.88% <= 37 milliseconds
43.53% <= 38 milliseconds
46.31% <= 39 milliseconds
48.92% <= 40 milliseconds
51.68% <= 41 milliseconds
54.27% <= 42 milliseconds
56.69% <= 43 milliseconds
59.23% <= 44 milliseconds
61.34% <= 45 milliseconds
63.50% <= 46 milliseconds
65.34% <= 47 milliseconds
66.95% <= 48 milliseconds
68.36% <= 49 milliseconds
69.96% <= 50 milliseconds
71.74% <= 51 milliseconds
73.72% <= 52 milliseconds
75.78% <= 53 milliseconds
77.81% <= 54 milliseconds
80.02% <= 55 milliseconds
82.06% <= 56 milliseconds
84.13% <= 57 milliseconds
85.70% <= 58 milliseconds
87.02% <= 59 milliseconds
88.34% <= 60 milliseconds
89.50% <= 61 milliseconds
90.48% <= 62 milliseconds
91.43% <= 63 milliseconds
92.49% <= 64 milliseconds
93.29% <= 65 milliseconds
93.91% <= 66 milliseconds
94.46% <= 67 milliseconds
94.92% <= 68 milliseconds
95.37% <= 69 milliseconds
95.80% <= 70 milliseconds
96.15% <= 71 milliseconds
96.49% <= 72 milliseconds
96.78% <= 73 milliseconds
97.07% <= 74 milliseconds
97.32% <= 75 milliseconds
97.56% <= 76 milliseconds
97.75% <= 77 milliseconds
97.99% <= 78 milliseconds
98.21% <= 79 milliseconds
98.37% <= 80 milliseconds
98.51% <= 81 milliseconds
98.67% <= 82 milliseconds
98.82% <= 83 milliseconds
98.98% <= 84 milliseconds
99.12% <= 85 milliseconds
99.25% <= 86 milliseconds
99.34% <= 87 milliseconds
99.42% <= 88 milliseconds
99.48% <= 89 milliseconds
99.54% <= 90 milliseconds
99.57% <= 91 milliseconds
99.59% <= 92 milliseconds
99.61% <= 93 milliseconds
99.63% <= 94 milliseconds
99.65% <= 95 milliseconds
99.67% <= 96 milliseconds
99.69% <= 97 milliseconds
99.71% <= 98 milliseconds
99.72% <= 99 milliseconds
99.72% <= 100 milliseconds
99.73% <= 101 milliseconds
99.74% <= 102 milliseconds
99.74% <= 103 milliseconds
99.76% <= 104 milliseconds
99.77% <= 105 milliseconds
99.78% <= 106 milliseconds
99.79% <= 107 milliseconds
99.80% <= 108 milliseconds
99.81% <= 109 milliseconds
99.83% <= 110 milliseconds
99.84% <= 111 milliseconds
99.85% <= 112 milliseconds
99.86% <= 113 milliseconds
99.87% <= 114 milliseconds
99.89% <= 115 milliseconds
99.90% <= 116 milliseconds
99.90% <= 117 milliseconds
99.90% <= 118 milliseconds
99.91% <= 119 milliseconds
99.91% <= 120 milliseconds
99.91% <= 121 milliseconds
99.92% <= 122 milliseconds
99.92% <= 123 milliseconds
99.93% <= 124 milliseconds
99.93% <= 125 milliseconds
99.93% <= 126 milliseconds
99.94% <= 127 milliseconds
99.94% <= 128 milliseconds
99.94% <= 129 milliseconds
99.95% <= 130 milliseconds
99.95% <= 133 milliseconds
99.95% <= 134 milliseconds
99.95% <= 137 milliseconds
99.95% <= 138 milliseconds
99.96% <= 139 milliseconds
99.96% <= 140 milliseconds
99.96% <= 141 milliseconds
99.96% <= 143 milliseconds
99.96% <= 144 milliseconds
99.96% <= 145 milliseconds
99.96% <= 146 milliseconds
99.97% <= 148 milliseconds
99.97% <= 149 milliseconds
99.97% <= 151 milliseconds
99.97% <= 157 milliseconds
99.97% <= 158 milliseconds
99.97% <= 160 milliseconds
99.97% <= 162 milliseconds
99.97% <= 163 milliseconds
99.98% <= 165 milliseconds
99.98% <= 168 milliseconds
99.98% <= 169 milliseconds
99.98% <= 210 milliseconds
99.98% <= 225 milliseconds
99.98% <= 227 milliseconds
99.98% <= 228 milliseconds
99.99% <= 229 milliseconds
99.99% <= 230 milliseconds
99.99% <= 231 milliseconds
99.99% <= 232 milliseconds
99.99% <= 442 milliseconds
99.99% <= 443 milliseconds
100.00% <= 444 milliseconds
100.00% <= 445 milliseconds
100.00% <= 446 milliseconds
100.00% <= 447 milliseconds
1176.61 requests per second

====== RPUSH ======
  100000 requests completed in 2.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

97.52% <= 1 milliseconds
99.70% <= 2 milliseconds
99.79% <= 3 milliseconds
99.87% <= 4 milliseconds
99.89% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 229 milliseconds
100.00% <= 229 milliseconds
39572.62 requests per second

LPOP: 742.42